package com.love.cookies.health_encyclopedia.Model.Bean;

/**
 * Created by xiekun on 2015/12/1 0001.
 *
 * 症状详情实体类
 */
public class SymptomDetailBean {
    /**
     * success : true
     * yi18 : {"name":"肾阴虚","img":"img/symptom/00009.jpg","place":"腰部","summary":"　　肾阴虚，是肾脏阴液不足表现的证候，多由久病伤肾，或禀赋不足房事过度，或过服温燥劫阴之品所致用现代说法来说，就是：肾阴虚-供给中枢神经、泌尿生殖系统的营养物质不足;通常情况下，阴虚用六味地黄丸。","disease":"不孕不育|肝火眩晕|肾虚|肾虚腰痛|子痰|症瘕|产后喘促","causeText":"<p>　　一、肾阴虚，是肾赃阴液不足表现的证候。多由久病伤肾，或禀赋不足房事过度，或过服温燥劫阴之品所致。<\/p>","drug":"六味地黄丸|明目地黄丸|二至丸","detailText":"<p>一、诊断：<\/p> \n<p>　　1、临床表现：腰膝酸疼，眩晕耳鸣，失眠多梦，男子阳强易举，遗精，妇女经少经闭，或见崩漏，形体消瘦，潮热盗汗，五心烦热，咽干颧红，溲黄便干，舌红少津，脉细数。<\/p> \n<p>　　2、肾阴虚和肾阳虚<\/p> \n<p>　　男同志来讲，肾阴虚造成的精子的数量、质量下降，造成了免疫功能的低下或者是亢进，或者造成了精液的液化不良，甚至会引起性功能的障碍，导致勃起不坚等等，<\/p> \n<p>　　女同志会造成月经的周期延长，或者缩短，月经量的减少，白带的减少，色质发黄，出现了烦躁、口干、失眠，盗汗等等，甚至在女性不孕这块出现了卵泡发育不正常，黄体生成不足，黄体萎缩不全等等。<\/p> \n<p>　　这涉及到中医的一个术语，也涉及到临床的证型，肾虚主要是四方面：肾阴虚，肾阳虚，肾经亏虚，肾气虚。<\/p> \n<p>　　肾阴虚和肾阳虚的区别在于，如果是把肾阴是物质上的缺乏，肾阳就是功能上的匮乏，物质上的缺乏就是腰膝酸软，头发晕，还有如果在年轻人的身上出现早泄、遗精，还有出现五心烦热，失眠、心烦，中医有阴虚生内热，阳虚生外寒，如果在老年人出现的肾阴虚就容易脱发或发白的比较早，容易耳鸣、耳背，牙齿松动，眼花的比较早一些，所以说，这是肾阴虚，肾阴虚一般说在中青年发生的比较多，我们在临床上的症状比较多。<\/p> \n<p>　　那么，肾阳虚有一些症状和肾阴虚也是有共性的，比如说腰膝酸软，四肢乏力，但是肾阳虚更体现是功能性的所谓出现的四肢不温，那个是五心烦热，这个是手脚发凉，面色容易有一些黄白畏寒怕冷，如果是中青年出现性欲减退、阳痿，人感觉经常有一种神气疲惫的感觉，因为是功能性的，更多的体现在这方面，我们说肾阳虚和肾阴虚不是截然分开的，在临床上经常遇到这样的人，我究竟是肾阴虚还是肾阳虚，我就讲了，我说肾阴虚、肾阳虚也好，如果匮乏到一定程度了，就是阴损积阳，阳损积阴，肾阳虚时间长了会有肾阴虚的症状，所以我们再补肾阳的时候，一定要补肾阴，而且要阴中求阳，而且在补肾阴的时候也不是一味的只用补肾阴的药物。<\/p> \n<p>二、治疗：<\/p> \n<p>　　肾阴虚可以吃哈士膜、黑木耳、黑芝麻、小核桃等进行食补,补肾药物则有左归丸、六味地黄丸、知柏地黄丸等。<\/p> \n<p>　　山药，性平，味甘，为中医\u201c上品\u201d之药，除了具有补肺、健脾作用外，还能益肾填精。凡肾虚之人，宜常食之。<\/p> \n<p>　　干贝，又称江珧柱。性平，味甘咸，能补肾滋阴，故肾阴虚者宜常食之。<\/p> \n<p>　　鲈鱼，又称花鲈、鲈子鱼。性平，味甘，既能补脾胃，又可补肝肾，益筋骨。<\/p> \n<p>　　栗子，性温，味甘，除有补脾健胃作用外，更有补肾壮腰之功，对肾虚腰痛者，最宜食用。<\/p> \n<p>　　枸杞子，性平，味甘，具有补肾养肝、益精明目、壮筋骨、除腰痛、久服能益寿延年等功用。尤其是中年女性肾虚之人，食之最宜。<\/p> \n<p>　　何首乌，有补肝肾、益精血的作用，历代医家均用之于肾虚之人。凡是肾虚之人头发早白，或腰膝软弱、筋骨酸痛，或男子遗精，女子带下者，食之皆宜。<\/p> \n<p>　　忌吃或少吃:荸荠、柿子、生萝卜、生菜瓜、生黄瓜、生地瓜、西瓜、甜瓜、洋葱、辣椒、芥菜、丁香、茴香、胡椒、薄荷、莼菜、菊花、盐、酱、白酒及香烟等。<\/p> \n<p>　　肾阴虚忌吃或少吃\u2014\u2014荸荠、柿子、生萝卜、生菜瓜、生黄瓜、生地瓜、西瓜、甜瓜、洋葱、辣椒、芥菜、丁香、茴香、胡椒、薄荷、莼菜、盐、酱、白酒及香烟等。<\/p> \n<p>　　《黄帝内经》反复论述了不良的精神心理状态对人体脏器所造成的损伤，认为\u201c怒伤肝\u201d、\u201c喜伤心\u201d、\u201c思伤脾\u201d、\u201c忧悲伤肺\u201d、\u201c恐伤肾\u201d。情绪好坏会直接影响到人体雌激素等的分泌。因此保持良好的心态更有助于健康身体的恢复。<\/p> \n<p>　　肾虚进补原则：冬季多吃鱼、虾、牡蛎和韭菜等食物。这类食物富含蛋白质、牛磺酸、精氨酸和锌，动物的鞭和甲鱼也是补肾的上佳选择。冬季多食用一些偏于温热性特别是能够温补肾阳的食物，适当摄入营养丰富、温肾填精、产热量高、易于消化的食物，如羊肉，补体之虚，益肾之气，提高免疫力。也可食用温性水果，如大枣、橘子、柿子等，以补血益肾填精，抵御寒邪。<\/p> \n<p>　　肾阴虚者，饮食中应多吃清凉食品，如金银花、绿豆、银耳、莲子、决明子、鱼汤蛤蜊雀肉鹿肉等等进行滋补;<\/p> \n<p>　　芝麻、粟米、豇豆、牛骨髓、狗肉、羊骨、猪肾、淡菜、干贝、鲈鱼、桑椹、芡实、栗子、胡桃、山药、枸杞子、冬虫夏草、杜仲、何首乌、海参、海马、虾子，此外，肾虚者还宜服食龟肉、鸽肉、猪肉、甲鱼、蛤蚧、莲子、松子、荠菜、韭菜、蜂王浆、灵芝、燕窝、阿胶、紫河车、地黄、锁阳、肉苁蓉等。<\/p> \n<p>　　注意饮食和作息要规律 少辛辣 不能熬夜 长期保持 不要以为晚上不睡白天睡就可以补回来了 这样的想法是错的 因为很多器官的休息和排毒时间都只是在晚上 冰冻三尺非一日之寒 罗马也不是一天建成的 这属于身体亚健康 切记 得长期保持良好生活习惯。<\/p>","check":"浆细胞|积液溶菌酶|尿去氢异雄酮|肾脏MRI检查|肾脏CT检查|B型超声波检查|尿常规|肾小球滤过率（GFR）|肾活检","count":302,"rcount":0,"fcount":0,"id":9}
     */

    private boolean success;
    /**
     * name : 肾阴虚
     * img : img/symptom/00009.jpg
     * place : 腰部
     * summary : 　　肾阴虚，是肾脏阴液不足表现的证候，多由久病伤肾，或禀赋不足房事过度，或过服温燥劫阴之品所致用现代说法来说，就是：肾阴虚-供给中枢神经、泌尿生殖系统的营养物质不足;通常情况下，阴虚用六味地黄丸。
     * disease : 不孕不育|肝火眩晕|肾虚|肾虚腰痛|子痰|症瘕|产后喘促
     * causeText : <p>　　一、肾阴虚，是肾赃阴液不足表现的证候。多由久病伤肾，或禀赋不足房事过度，或过服温燥劫阴之品所致。</p>
     * drug : 六味地黄丸|明目地黄丸|二至丸
     * detailText : <p>一、诊断：</p>
     <p>　　1、临床表现：腰膝酸疼，眩晕耳鸣，失眠多梦，男子阳强易举，遗精，妇女经少经闭，或见崩漏，形体消瘦，潮热盗汗，五心烦热，咽干颧红，溲黄便干，舌红少津，脉细数。</p>
     <p>　　2、肾阴虚和肾阳虚</p>
     <p>　　男同志来讲，肾阴虚造成的精子的数量、质量下降，造成了免疫功能的低下或者是亢进，或者造成了精液的液化不良，甚至会引起性功能的障碍，导致勃起不坚等等，</p>
     <p>　　女同志会造成月经的周期延长，或者缩短，月经量的减少，白带的减少，色质发黄，出现了烦躁、口干、失眠，盗汗等等，甚至在女性不孕这块出现了卵泡发育不正常，黄体生成不足，黄体萎缩不全等等。</p>
     <p>　　这涉及到中医的一个术语，也涉及到临床的证型，肾虚主要是四方面：肾阴虚，肾阳虚，肾经亏虚，肾气虚。</p>
     <p>　　肾阴虚和肾阳虚的区别在于，如果是把肾阴是物质上的缺乏，肾阳就是功能上的匮乏，物质上的缺乏就是腰膝酸软，头发晕，还有如果在年轻人的身上出现早泄、遗精，还有出现五心烦热，失眠、心烦，中医有阴虚生内热，阳虚生外寒，如果在老年人出现的肾阴虚就容易脱发或发白的比较早，容易耳鸣、耳背，牙齿松动，眼花的比较早一些，所以说，这是肾阴虚，肾阴虚一般说在中青年发生的比较多，我们在临床上的症状比较多。</p>
     <p>　　那么，肾阳虚有一些症状和肾阴虚也是有共性的，比如说腰膝酸软，四肢乏力，但是肾阳虚更体现是功能性的所谓出现的四肢不温，那个是五心烦热，这个是手脚发凉，面色容易有一些黄白畏寒怕冷，如果是中青年出现性欲减退、阳痿，人感觉经常有一种神气疲惫的感觉，因为是功能性的，更多的体现在这方面，我们说肾阳虚和肾阴虚不是截然分开的，在临床上经常遇到这样的人，我究竟是肾阴虚还是肾阳虚，我就讲了，我说肾阴虚、肾阳虚也好，如果匮乏到一定程度了，就是阴损积阳，阳损积阴，肾阳虚时间长了会有肾阴虚的症状，所以我们再补肾阳的时候，一定要补肾阴，而且要阴中求阳，而且在补肾阴的时候也不是一味的只用补肾阴的药物。</p>
     <p>二、治疗：</p>
     <p>　　肾阴虚可以吃哈士膜、黑木耳、黑芝麻、小核桃等进行食补,补肾药物则有左归丸、六味地黄丸、知柏地黄丸等。</p>
     <p>　　山药，性平，味甘，为中医“上品”之药，除了具有补肺、健脾作用外，还能益肾填精。凡肾虚之人，宜常食之。</p>
     <p>　　干贝，又称江珧柱。性平，味甘咸，能补肾滋阴，故肾阴虚者宜常食之。</p>
     <p>　　鲈鱼，又称花鲈、鲈子鱼。性平，味甘，既能补脾胃，又可补肝肾，益筋骨。</p>
     <p>　　栗子，性温，味甘，除有补脾健胃作用外，更有补肾壮腰之功，对肾虚腰痛者，最宜食用。</p>
     <p>　　枸杞子，性平，味甘，具有补肾养肝、益精明目、壮筋骨、除腰痛、久服能益寿延年等功用。尤其是中年女性肾虚之人，食之最宜。</p>
     <p>　　何首乌，有补肝肾、益精血的作用，历代医家均用之于肾虚之人。凡是肾虚之人头发早白，或腰膝软弱、筋骨酸痛，或男子遗精，女子带下者，食之皆宜。</p>
     <p>　　忌吃或少吃:荸荠、柿子、生萝卜、生菜瓜、生黄瓜、生地瓜、西瓜、甜瓜、洋葱、辣椒、芥菜、丁香、茴香、胡椒、薄荷、莼菜、菊花、盐、酱、白酒及香烟等。</p>
     <p>　　肾阴虚忌吃或少吃——荸荠、柿子、生萝卜、生菜瓜、生黄瓜、生地瓜、西瓜、甜瓜、洋葱、辣椒、芥菜、丁香、茴香、胡椒、薄荷、莼菜、盐、酱、白酒及香烟等。</p>
     <p>　　《黄帝内经》反复论述了不良的精神心理状态对人体脏器所造成的损伤，认为“怒伤肝”、“喜伤心”、“思伤脾”、“忧悲伤肺”、“恐伤肾”。情绪好坏会直接影响到人体雌激素等的分泌。因此保持良好的心态更有助于健康身体的恢复。</p>
     <p>　　肾虚进补原则：冬季多吃鱼、虾、牡蛎和韭菜等食物。这类食物富含蛋白质、牛磺酸、精氨酸和锌，动物的鞭和甲鱼也是补肾的上佳选择。冬季多食用一些偏于温热性特别是能够温补肾阳的食物，适当摄入营养丰富、温肾填精、产热量高、易于消化的食物，如羊肉，补体之虚，益肾之气，提高免疫力。也可食用温性水果，如大枣、橘子、柿子等，以补血益肾填精，抵御寒邪。</p>
     <p>　　肾阴虚者，饮食中应多吃清凉食品，如金银花、绿豆、银耳、莲子、决明子、鱼汤蛤蜊雀肉鹿肉等等进行滋补;</p>
     <p>　　芝麻、粟米、豇豆、牛骨髓、狗肉、羊骨、猪肾、淡菜、干贝、鲈鱼、桑椹、芡实、栗子、胡桃、山药、枸杞子、冬虫夏草、杜仲、何首乌、海参、海马、虾子，此外，肾虚者还宜服食龟肉、鸽肉、猪肉、甲鱼、蛤蚧、莲子、松子、荠菜、韭菜、蜂王浆、灵芝、燕窝、阿胶、紫河车、地黄、锁阳、肉苁蓉等。</p>
     <p>　　注意饮食和作息要规律 少辛辣 不能熬夜 长期保持 不要以为晚上不睡白天睡就可以补回来了 这样的想法是错的 因为很多器官的休息和排毒时间都只是在晚上 冰冻三尺非一日之寒 罗马也不是一天建成的 这属于身体亚健康 切记 得长期保持良好生活习惯。</p>
     * check : 浆细胞|积液溶菌酶|尿去氢异雄酮|肾脏MRI检查|肾脏CT检查|B型超声波检查|尿常规|肾小球滤过率（GFR）|肾活检
     * count : 302
     * rcount : 0
     * fcount : 0
     * id : 9
     */

    private Yi18Entity yi18;

    public void setSuccess(boolean success) {
        this.success = success;
    }

    public void setYi18(Yi18Entity yi18) {
        this.yi18 = yi18;
    }

    public boolean isSuccess() {
        return success;
    }

    public Yi18Entity getYi18() {
        return yi18;
    }

    public static class Yi18Entity {
        private String name;
        private String img;
        private String place;
        private String summary;
        private String disease;
        private String causeText;
        private String drug;
        private String detailText;
        private String check;
        private int count;
        private int rcount;
        private int fcount;
        private int id;

        public void setName(String name) {
            this.name = name;
        }

        public void setImg(String img) {
            this.img = img;
        }

        public void setPlace(String place) {
            this.place = place;
        }

        public void setSummary(String summary) {
            this.summary = summary;
        }

        public void setDisease(String disease) {
            this.disease = disease;
        }

        public void setCauseText(String causeText) {
            this.causeText = causeText;
        }

        public void setDrug(String drug) {
            this.drug = drug;
        }

        public void setDetailText(String detailText) {
            this.detailText = detailText;
        }

        public void setCheck(String check) {
            this.check = check;
        }

        public void setCount(int count) {
            this.count = count;
        }

        public void setRcount(int rcount) {
            this.rcount = rcount;
        }

        public void setFcount(int fcount) {
            this.fcount = fcount;
        }

        public void setId(int id) {
            this.id = id;
        }

        public String getName() {
            return name;
        }

        public String getImg() {
            return "http://www.yi18.net/" + img;
        }

        public String getPlace() {
            return place;
        }

        public String getSummary() {
            return summary;
        }

        public String getDisease() {
            return disease;
        }

        public String getCauseText() {
            return causeText;
        }

        public String getDrug() {
            return drug;
        }

        public String getDetailText() {
            return detailText;
        }

        public String getCheck() {
            return check;
        }

        public int getCount() {
            return count;
        }

        public int getRcount() {
            return rcount;
        }

        public int getFcount() {
            return fcount;
        }

        public int getId() {
            return id;
        }
    }
}
